SimpleTrade/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SimpleTrade/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТЧ(ТекСтр, ПоСумме)
	Если ПоСумме Тогда
		Если ТекСтр.Количество > 0 Тогда
			ТекСтр.Цена = ТекСтр.Сумма / ТекСтр.Количество;
		КонецЕсли;
	Иначе
		ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.Количество;
	КонецЕсли;
КонецПроцедуры
